#include <iostream>
using namespace std;

// Задача 1. Заповнити довільний двовимірний динамічний масив
// m x n (m, n -> вводить користувач) числами по порядку починаючи
// від 1.
int main()
{
    int m;
    cin >> m;
    int n;
    cin >> n;
    int** arr = new int*[m]; // виділити пам'ять на m рядків
    for (int i = 0; i < m; i++)
    {
        // для кожного рядка двовимірного масиву виділити пам'ять на n елементів
        arr[i] = new int[n];
    }

    int k = 1; //початкове значення масиву(першого елементу)
    for (int i = 0; i < m; i++) // цикл для кожного рядка
    {
        for (int j = 0; j < n; j++) // цикл для кожного елементу рядка(стовбчика)
        {
            // arr[i][j] -> кожний елемент масива по рядкам
            arr[i][j] = k; k++;
        }
    }

    for (int i = 0; i < m; i++)
    {
        for (int j = 0; j < n; j++)
        {
            cout << arr[i][j] << ' '; // вивести всі елементи массива по рядках через пробіл
        }
        cout << '\n'; // перенести рядок після виводу кожного рядка
    }
}


/*
Задача 2. Створити двовимірний динамічний масив нецілих чисел.
    Заповнити його за правилом:
    кожний елмент дорівнює "номер рядка. номер стовпчика"
    наприклад елемент в 4 рядку і 7 стовпчику буде нецілим числом 4.7
    вивести на екран за допомогою функції

*/