#include <iostream>
using namespace std;

/* Показчик - це змінна, що зберігає інформацію про місце в пам'яті іншої змінної */

// Створити функцію що приймає змінну та змінює цю змінну збільшивши її на 2

void plusX4(int* a) {
    *a += 2; // *a - операція розіменування, що переходить по адресі що лежить у 
             //      показчику 'a'
}

int main()
{
    int x;
    int* px = &x; // int* - тип даних показчика на int
                  // &x - оператор що дивиться адресу зміної 'x'

    cin >> x;
    plusX4(px);
    cout << x;
}
