#include <iostream>
using namespace std;
/*
* 
    Задача 3. Створити функцію, що приймає показчик на елемент та масив
    і повертає індекс цього елемента в масиві.
    int f1(int arr*, int* pa);
    cout << f1(arr, &arr[3]); ~> 3

    Задача 4. Створити функцію, що приймає показчик на масив і звільняє пам'ять
    цього масиву.

    Задача 5. Створити функцію, що приймає показчик на масив та його розмір та
    сортує масив.

*/
int main()
{
    
}