#include <iostream>
#include <Windows.h>
using namespace std;

int main()
{
    SetConsoleOutputCP(1251);
    SetConsoleCP(1251);
    /*
    
    Завдання 2.
    Напишіть програму, яка просить користувача ввести два натуральних числа A і B,
    а потім обчислює та друкує НCД (найбільший спільний дільник) чисел A і B.
    НCД двох чисел — це найбільше число, яке ділить A і B без залишка.
    цикл, щоб знайти НCД для A і B, і скористайтеся оператором if, щоб перевірити,
    чи є число дільником як A, так і B. Коли НCД знайдено, надрукуйте його.
    Переконайтеся, що і A, і B є натуральними числами.
    */
    /*
    Завдання 3.
    Напишіть програму, щоб перевірити, чи число, введене користувачем, є паліндромом чи ні.
    Число-паліндром — це число, яке читається як назад, так і вперед. Використовуйте цикл,
    щоб перевернути число, введене користувачем, і скористайтеся оператором if, щоб перевірити,
    чи перевернуте число дорівнює початковому числу.
    */
    /*
    Завдання 4.
    Напишіть програму для обчислення факториалу числа. Попросіть користувача ввести число,
    а потім за допомогою циклу обчисліть факториал. Використовуйте оператор if, щоб переконатися,
    що введене число є додатним цілим числом. Не використовуйте вкладені цикли або масиви.
    */
    /*
   Задача 1. Напишіть програму, яка пропонує користувачеві ввести натуральне число n,
   а потім друкує перші n простих чисел, використовуючи лише цикл while.
   */
    /*
   Задача 2. Напишіть програму, яка пропонує користувачеві ввести натуральне число n,
   а потім друкує послідовність Фібоначчі до n-го члена, використовуючи лише цикл for.
   */
    /*
   Задача 3. Напишіть програму, яка пропонує користувачеві ввести натуральне число n,
   а потім друкує трикутник із числами з n рядків, щоб n-й рядок складався з чисел
   від n до 1. Наприклад, якщо n дорівнює 5, вихід має виглядати так:

   5
   4 5
   3 4 5
   2 3 4 5
   1 2 3 4 5
   */

    /*
   Задача 4. Напишіть програму, яка запропонує користувачеві ввести натуральне число n,
   а потім роздрукує форму ромба, використовуючи зірочки з n рядками. Наприклад,
   якщо n дорівнює 5, результат має виглядати так:

     *
    ***
   *****
    ***
     *

     */


     /*
   Напишіть програму, яка пропонує користувачеві ввести натуральне число n, а потім
   друкує форму піраміди, використовуючи зірочки з n рядками. Наприклад, якщо n дорівнює 5,
   результат має виглядати так:

       *
      ***
     *****
    *******
   *********

   */
}
