#include <iostream>
#include <Windows.h>
using namespace std;
int main()
{
    SetConsoleCP(1251);
    SetConsoleOutputCP(1251);
    //do while, for

    // Задача 1. Користувач вводить два числа діапазону. Програма просить
    // ввести ще одне число цього діапазону і перевіряє чи він правильно
    // записав це число, чи ні. І просить ввести знову, якщо число введено
    // неправильно

    int a, b;
    cout << "Введіть початок діапазону: ";
    cin >> a;
    cout << "Введіть кінець діапазону: ";
    cin >> b;

    int c;
    do{
        cout << "Введіть число в діапазоні від " << a << " до " << b << ": ";
        cin >> c;
    } while (c < a || c > b);

    cout << "Число в діапазоні!\n";
}