#include <iostream>

int main()
{
    std::cout << "Hello World!\n";

    /* Завдання 1. Вивести на екран усі числа від нуля
    до введеного користувачем числа включно.

    Завдання 2. Користувач вводить дві межі діапазону,
    вивести на екран усі числа з цього діапазону. Передбачити,
    щоб користувач міг вводити межі діапазону в довільному
    порядку.

    Завдання 3. Користувач вводить дві межі діапазону.
    Порахувати суму всіх чисел діапазону.

    Завдання 4. Користувач з клавіатури вводить числа.
    Порахувати їхню суму і вивести на екран, щойно користувач
    введе нуль

    Задача 5. Користувач вводить число. Програма робить нескінченну
    дію над цим числом за умовою. Якщо число парне, вона ділить
    його навпіл і продовжує, якщо число непарне вона множить його
    на три і додає одиничку і продовжує.
    Якщо під час дії число дорівнює 1, то завершуємо програму 
    виводом одинички
    Якщо під час дії число перевищує 1000000, то завершуємо програму
    виводом слова "нескінченність"

    */
}