#include <iostream>
using namespace std;

// Показчики. Використання показчиків у функціях та задачах

// Задача 2. Написати функцію що приймає рядок символів та повертає
// довжину цього рядка. Рядок символів у форматі const char*.

int main()
{
    int a = 10; // змінна ціле число
    a = 11;     // перезапис значення цілого числа
    cout << a;  // доступ(читання) значення цілого числа

    int* pa = &a; // показчик на змінну "а".  &a -> взяття адреси змінної "a"
    *pa = 12;   // перезапис значення цілого числа по показчику pa (розіменування)
    cout << *pa; // доступ(читання) значення цілого числа по показчику

    int b = 4;
    pa = &b;   // зміна адреси на яку вказує показчик. переприв'язка до іншої змінної 
    cout << pa;// доступ(читання) адреси тої змінної на яку вказує показчик

    const int* pb = &a; // показчик вказує на змінну і дія *pb= недоступна
    int* const pc = &a; // показчик вказує на змінну і змінювати адресу
                        // міняти змінну на яку вказує показчик НЕМОЖНА дія pc= недоступна
}
