#include <iostream>
#include <Windows.h>
using namespace std;

int main()
{
	SetConsoleOutputCP(1251);
	SetConsoleCP(1251);
    /* Завдання 1. Вивести на екран усі числа від нуля
    до введеного користувачем числа включно.
    
    
    int a;
    cin >> a;
    int i = 0;
    while (i <= a)
    {
        cout << i++ << ' '; 
        // << операція має більший пріорітет тому спочатку працює
        // cout << i, а потім працює інкремент ++
    }
    */
    
    /*
    Завдання 2. Користувач вводить дві межі діапазону,
    вивести на екран усі числа з цього діапазону. Передбачити,
    щоб користувач міг вводити межі діапазону в довільному
    порядку.
    
    int a, b;
    cin >> a;
    cin >> b;
    if (a < b)
    {
        while (a <= b)
        {
            cout << a++ << ' ';
        }
    }
    else {
        while (b <= a)
        {
            cout << a-- << ' ';
        }
    }
    */

    /*
    Завдання 3. Користувач вводить дві межі діапазону.
    Порахувати суму всіх чисел діапазону.
    
    
    int a, b;
    cin >> a >> b;
    int sum = 0;
    while (a <= b)
    {
        sum += a++;
    }
    cout << sum;
    */
    
    /*
    Завдання 4. Користувач з клавіатури вводить числа.
    Порахувати їхню суму і вивести на екран, щойно користувач
    введе нуль програма закінчується
   
    int a;
    int sum = 0;
    do // робить один раз тіло цикла без умови 100%
    {
        cin >> a; // користувач вводить
        sum += a; // додаємо до суми
    } while (a != 0); // якщо ввів 0 то цикл завершується
    */
    
    /*
    Задача 5. Користувач вводить число. Програма робить нескінченну
    дію над цим числом за умовою. Якщо число парне, вона ділить
    його навпіл і продовжує, якщо число непарне вона множить його
    на три і додає одиничку і продовжує.
    Якщо під час дії число дорівнює 1, то завершуємо програму
    виводом одинички
    Якщо під час дії число перевищує 1000000, то завершуємо програму
    виводом слова "нескінченність"
   

    int a;
    cin >> a;
    while (true)
    {
        if (a % 2 == 0)
        {
            a /= 2;
        }else{
            a *= 3;
            a++;
        }
        if (a == 1)
        {
            cout << 1;
            break;
        }
        if (a > 1000000)
        {
            cout << "Нескінченність";
            break;
        }
    }
    */
    
    /*
    Завдання 1. Написати гру «Вгадай число». Програма
    загадує число в діапазоні від 1 до 500. Користувач
    намагається його вгадати. Після кожної спроби програма
    видає підказки, чи його число є більшим або меншим за
    задумане. У кінці програма видає статистику: за скільки
    спроб угадано число. Передбачити вихід за допомогою 0,
    у разі, якщо користувачеві набридло вгадувати число.
    
    srand(time(NULL));
    int a;
    int r = rand() % 500 + 1;
    int i = 0;
    do
    {
        cin >> a;
        i++;
        if (a > r)
        {
            cout << "\nБагато!\n";
        }
        else if (a < r)
        {
            cout << "\nМало!\n";
        }
    } while (a != r && a != 0);
    if (a == r)
    {
        cout << "Ви вгадали! " << i << " спроб";
    }
    else {
        cout << "Ви не вгадали!";
    }
    */
   
    /*
    Завдання 2. Написати програму — конвертер валют.
    Реалізувати спілкування з користувачем через меню.
   
    int a;
    float n, v;
    cout << "Вітаємо в конверторі валют. Виберіть валюту для переводу:\n";
    cout << "1. UAH";
    cout << "2. USD";
    cout << "3. EUR";

    switch (a)
    {
    case 1:
        cout << "Введіть сумму для переводу: ";
        cin >> n;
        cout << "Ви переводите " << n << " гривень.\n";
        cout << "Виберіть валюту на яку переводимо.\n";
        cout << "1. USD";
        cout << "2. EUR";
        cin >> a;
        switch (a)
        {
        case 1:
            cout << n * 0.21 << " доларів";
            break;
        case 2:
            cout << n * 0.19 << " доларів";
            break;
        default:
            break;
        }
        break;
    case 2:
        cout << "Введіть сумму для переводу: ";
        cin >> n;
        cout << "Ви переводите " << n << " доларів.";
        break;
    case 3:
        cout << "Введіть сумму для переводу: ";
        cin >> n;
        cout << "Ви переводите " << n << " євро.";
        break;
    default:
        break;
    }
     */
    
    /*
    Завдання 3. Написати програму де користувач дивиться на змагання
    двух ботів, які виграють і програють очки за наступним правилом:
    кожен бот на початку має 10 поінтів
    кожний хід починається з загадування числа від 0 до 10
    той бот що загадав число більше забирає одне очко з очків противника
    гра закінчується коли у когось з ботів буде 0
    вивід кожного ходу у форматі:
    1 раунд. Бот1 загадав 4. Бот2 загадав 2. Бот1 виграв! Бот1: 11 Бот2: 9
    
    
    int bot1, bot2, score1 = 10, score2 = 10, i = 1;
    while (score1 != 0 && score2 != 0)
    {
        bot1 = rand() % 11;
        bot2 = rand() % 11;
        if (bot1 > bot2){ score2--; score1++; }
        else if (bot1 < bot2){ score2++; score1--; }
        printf("%3d раунд. ", i);
        printf("Бот1 загадав %2d. Бот2 загадав %2d. ", bot1, bot2);
        printf("%s виграв! ", bot1 > bot2 ? "Бот1" : bot1 < bot2 ? "Бот2" : "Ніхто не");
        printf("Бот1: %2d Бот2: %2d\n", score1, score2);
        i++;
    } 
    */
    
    /*
    Завдання 4. Користувач вводить два числа від 20 до 60. Програма має вивести на екран символ
    зірочки(*), після чого вивести тире (-) стільки разів, скільки вказано в 1 числі, а потім знову
    (*) і потім знову (-) стільки разів скільки вказано в 2 числі, після чого завершити рядок зірочкою
    (*). Приклад програми для чисел 20 та 30
    *--------------------*-----------------------------*

   
    int a, b;
    cin >> a >> b;
    cout << '*';
    for (int i = 0; i < a; i++) { cout << '-'; }
    cout << '*';
    for (int i = 0; i < b; i++) { cout << '-'; }
    cout << '*';
    */

    /*
    Завдання 1.
    Напишіть програму для друку всіх парних чисел від 1 до 50. Використовуйте цикл, 
    щоб перевірити всі числа від 1 до 50, і використовуйте оператор if, щоб перевірити, 
    чи число парне. Якщо число парне, виведіть його.
    
    Завдання 2.
    Напишіть програму, яка просить користувача ввести два натуральних числа A і B, 
    а потім обчислює та друкує НCД (найбільший спільний дільник) чисел A і B. 
    НCД двох чисел — це найбільше число, яке ділить A і B без залишка. 
    цикл, щоб знайти НCД для A і B, і скористайтеся оператором if, щоб перевірити, 
    чи є число дільником як A, так і B. Коли НCД знайдено, надрукуйте його. 
    Переконайтеся, що і A, і B є натуральними числами.
    
    Завдання 3.
    Напишіть програму, щоб перевірити, чи число, введене користувачем, є паліндромом чи ні. 
    Число-паліндром — це число, яке читається як назад, так і вперед. Використовуйте цикл, 
    щоб перевернути число, введене користувачем, і скористайтеся оператором if, щоб перевірити, 
    чи перевернуте число дорівнює початковому числу.
    
    Завдання 4.
    Напишіть програму для обчислення факториалу числа. Попросіть користувача ввести число, 
    а потім за допомогою циклу обчисліть факториал. Використовуйте оператор if, щоб переконатися, 
    що введене число є додатним цілим числом. Не використовуйте вкладені цикли або масиви.
    */
    
}