#include <iostream>
using namespace std; 

 // Урок 38. Багатовимірні динамічні масиви

/*
Задача 1. Створити функцію що приймає динамічний масив, його розмір та деяке число x та
повертає новий масив на один менше з якого було видалено перше таке число x.Якщо x не
зустрілося в масиві, то масив повертається ідентичний першому.
*/
int main()
{
    std::cout << "Hello World!\n";
}
