#include <iostream>

// Задачі

int main()
{
    /*
    Задача 3. Створити функцію, що приймає массив з символів та посилання на змінну length
    та через властивості посилань записує розмір массиву у змінну length

    Задача 4. Створити функцію, що приймає 3 числа через посилання та записує в кожне з чисел 
    середнє значення з трьох чисел.

    Задача 5. Створити функцію, що приймає посилання на int та double та міняє місцями значення
    між цими змінними враховуючи втрату даних через типи.
    
    Задача 6. Створити функцію, що приймає двовимірний масив, та його відповідні
    розмірі n,m, та шукає рядок в якому сума елементів найменша і повертає показчик 
    на початок цього рядка. Всі змінні будуть посиланнями, щоб не дублювати значення в пам'яті

    Задача 7. Створити функцію, що приймає посилання на масив та посилання на його розмір, 
    та зменшує його відкинувши усі від'ємні значення. Має мінятись і сам масив і змінні його
    розміру.

    */
}