#include <iostream>
using namespace std;

/* Ѕагатовимiрнi динамiчнi масиви */ 

int main()
{
    int x = 3, y= 1, h = 2, w = 5; // чотири вимiра, 
	//к-сть сторiнок з таблиц€ми, 
	//к-сть р€дкiв в таблиц€х
	//к-сть стовбцiв в таблиц€х
	//к-сь символiв в комiрках таблицi

    int**** arr = new int***[x];	// видiл€Їмо пам'€ть пiд таблицю
	for (int i = 0; i < x; i++) // дл€ кожноњ таблицi
	{
		arr[i] = new int**[y];	// видiл€Їмо пам'€ть пiд р€дках
		for (int j = 0; j < y; j++) // дл€ кожного р€дка
		{
			arr[i][j] = new int*[h]; // видiл€Їмо пам'€ть пiд елементи (стовчики)
			for (int k = 0; k < h; k++)// дл€ кожного елемента
			{
				arr[i][j][k] = new int[w]; // видiленн€ пам'€тi пiд кожний символ комiрок таблиць
				for (int n = 0; n < h; n++)// дл€ кожного символа елемента
				{
					arr[i][j][k][n] = 0;
				}
			}
		}
	}
}
