#include <iostream>
#include <Windows.h>
using namespace std;
int main()
{
    SetConsoleCP(1251);
    SetConsoleOutputCP(1251);

    // Задача 1. Користувач вводить два числа a та b які являються сторонами 
    // прямокутника. Програма рахує площу і перимтр цього прямокутника.

   /* int a, b;
    cout << "Введіть сторону прямокутника a:";
    cin >> a;
    cout << "Введіть сторону прямокутника b:";
    cin >> b;
    int s = a * b;
    int p = 2 * (a + b);

    cout << "Площа прямокутника: " << s << '\n';
    cout << "Периметр прямокутника: " << p << '\n';*/

    // pow(a, 2); -> а у квадраті, a * a
    // pow(a, 0.5); -> корінь з числа a

    // Задача 2. Користувач вводить два числа a та b які являються катетами 
    // прямокутного трикутника. Програма рахує гіпотенузу трикутника.
     int a, b;
    cout << "Введіть сторону прямокутника a:";
    cin >> a;
    cout << "Введіть сторону прямокутника b:";
    cin >> b;
    double c = pow(a * a + b * b, 0.5);
    cout << "Гіпотенуза: " << c;
}
