#include <iostream>
#include <Windows.h>
using namespace std;
int main()
{
    SetConsoleCP(1251);
    SetConsoleOutputCP(1251);

    // Задача 4. Користувач вводить значення об'єму куба. Порахувати сторону куба і вивести на екран
    
    /*double v;
    cout << "Введіть об'єм куба:";
    cin >> v;
    double a = pow(v, 0.33333);
    cout << "Сторона квадрата: " << a;*/

    // Задача 5. Користувач вводить значення швидкості руху автомобіля (км/год). 
    // Порахувати через скільки автомобіль проїде 100км
    
    /*int v;
    printf("Введіть швидкість автомобіля: ");
    cin >> v;
    double t = 100.0 / v;
    printf("Час за який автомобіль проїде 100 км: %lf", t);*/


    // Задача 6. Користувач вводить скільки у нього яблук та друзів. 
    // Порахувати скільки дістанеться кожному яблук якщо поділити їх порівну між усіма

    int f, a;
    printf("Введіть кількість друзів: ");
    cin >> f;
    f += 1;
    printf("Введіть кількість яблук: ");
    cin >> a;
    double n = (double)a / f;
    printf("Кількість яблук кожній людині: %.1lf", n);
}